rxdu/project_templates/mcu/stm32_ws/src/modules/nrf24l01p/nrf24l01x_reg.h
/*
* Command and register definitions of nrf24l01(+)
*/

#ifndef NRF24L01X_REG_H
#define NRF24L01X_REG_H

/****** Command Set for SPI ******/
#define NRF24L01_CMD_R_REGISTER 0x00
#define NRF24L01_CMD_W_REGISTER 0x20
#define NRF24L01_CMD_R_RX_PAYLOAD 0x61
#define NRF24L01_CMD_W_TX_PAYLOAD 0xA0
#define NRF24L01_CMD_FLUSH_TX 0xE1
#define NRF24L01_CMD_FLUSH_RX 0xE2
#define NRF24L01_CMD_REUSE_TX_PL 0xE3
#define NRF24L01_CMD_ACTIVATE 0x50
#define NRF24L01_CMD_R_RX_PL_WID 0x60
#define NRF24L01_CMD_W_ACK_PAYLOAD 0xA8
#define NRF24L01_CMD_W_TX_PAYLOAD_NO_ACK 0xB0
#define NRF24L01_CMD_NOP 0xFF

/****** Register Map Table ******/
#define NRF24L01_REG_CONFIG 0x00
#define NRF24L01_REG_EN_AA 0x01
#define NRF24L01_REG_EN_RXADDR 0x02
#define NRF24L01_REG_SETUP_AW 0x03
#define NRF24L01_REG_SETUP_RETR 0x04
#define NRF24L01_REG_RF_CH 0x05
#define NRF24L01_REG_RF_SETUP 0x06
#define NRF24L01_REG_STATUS 0x07
#define NRF24L01_REG_OBSERVE_TX 0x08
#define NRF24L01_REG_CD 0x09
#define NRF24L01_REG_RX_ADDR_P0 0x0A
#define NRF24L01_REG_RX_ADDR_P1 0x0B
#define NRF24L01_REG_RX_ADDR_P2 0x0C
#define NRF24L01_REG_RX_ADDR_P3 0x0D
#define NRF24L01_REG_RX_ADDR_P4 0x0E
#define NRF24L01_REG_RX_ADDR_P5 0x0F
#define NRF24L01_REG_TX_ADDR 0x10
#define NRF24L01_REG_RX_PW_P0 0x11
#define NRF24L01_REG_RX_PW_P1 0x12
#define NRF24L01_REG_RX_PW_P2 0x13
#define NRF24L01_REG_RX_PW_P3 0x14
#define NRF24L01_REG_RX_PW_P4 0x15
#define NRF24L01_REG_RX_PW_P5 0x16
#define NRF24L01_REG_FIFO_STATUS 0x17
#define NRF24L01_REG_DYNPD 0x1C
#define NRF24L01_REG_FEATURE 0x1D

/****** Register Bit Definition ******/
// CONFIG
#define NRF24L01_MASK_RX_DR 0x40
#define NRF24L01_MASK_TX_DS 0x20
#define NRF24L01_MASK_MAX_RT 0x10
#define NRF24L01_EN_CRC 0x08
#define NRF24L01_CRCO 0x04
#define NRF24L01_PWR_UP 0x02
#define NRF24L01_PRIM_RX 0x01

// EN_AA
#define NRF24L01_ENAA_P5 0x20
#define NRF24L01_ENAA_P4 0x10
#define NRF24L01_ENAA_P3 0x08
#define NRF24L01_ENAA_P2 0x04
#define NRF24L01_ENAA_P1 0x02
#define NRF24L01_ENAA_P0 0x01

// EN_RXADDR
#define NRF24L01_ERX_P5 0x20
#define NRF24L01_ERX_P4 0x10
#define NRF24L01_ERX_P3 0x08
#define NRF24L01_ERX_P2 0x04
#define NRF24L01_ERX_P1 0x02
#define NRF24L01_ERX_P0 0x01

// SETUP_AW
#define NRF24L01_5_BYTE 0x03
#define NRF24L01_4_BYTE 0x02
#define NRF24L01_3_BYTE 0x01

// SETUP_RETR
// RF_CH

// RF_SETUP ?
#define NRF24L01_PLL_LOCK 0x10
#define NRF24L01_RF_DR 0x8
#define NRF24L01_RF_PWR 0x6
#define NRF24L01_LNA_HCURR 0x01

// STATUS
#define NRF24L01_RX_DR 0x40
#define NRF24L01_TX_DS 0x20
#define NRF24L01_MAX_RT 0x10
#define NRF24L01_RX_P_NO 0x0E
#define NRF24L01_TX_FULL 0x01

// FIFO_STATUS
#define NRF24L01_FIFO_TX_REUSE 0x40
#define NRF24L01_FIFO_TX_FULL 0x20
#define NRF24L01_FIFO_TX_EMPTY 0x10
#define NRF24L01_FIFO_RX_FULL 0x20
#define NRF24L01_FIFO_RX_EMPTY 0x01

// DYNPD
#define DPL_P5 0x20
#define DPL_P4 0x10
#define DPL_P3 0x08
#define DPL_P2 0x04
#define DPL_P1 0x02
#define DPL_P0 0x01

// FEATURE
#define NRF24L01_EN_DPL 0x4
#define NRF24L01_EN_ACK_PAY 0x2
#define NRF24L01_EN_DYN_ACK 0x1

#endif